/**
  ************************************************************************
  * @file    main.c
  * @author  fire
  * @version V1.0
  * @date    2018-xx-xx
  * @brief   《FreeRTOS内核实现与应用开发实战指南》书籍例程
  *           列表与列表项
  ************************************************************************
  * @attention
  *
  * 实验平台:野火 STM32 系列 开发板
  * 
  * 官网    :www.embedfire.com  
  * 论坛    :http://www.firebbs.cn
  * 淘宝    :https://fire-stm32.taobao.com
  *
  ************************************************************************
  */
  
/*
*************************************************************************
*                             包含的头文件
*************************************************************************
*/
#include "list.h"
#include "task.h"

/*
*************************************************************************
*                              全局变量
*************************************************************************
*/


//uint32_t flag1;
//uint32_t flag2;
//
//void delay(uint32_t count)
//{
//	while(count--);
//}
//
//void delay_test(void)
//{
//	while(1)
//	{
//		flag1 = 1;
//		delay(1000);
//		flag1 = 0;
//		delay(1000);
//		
//		flag2 = 1;
//		delay(1000);
//		flag2 = 0;
//		delay(1000);
//	}		
//}


/*
************************************************************************
*                                main函数
************************************************************************
*/
/*
* 注意事项：1、该工程使用软件仿真，debug需选择 Ude Simulator
*           2、在Target选项卡里面把晶振Xtal(Mhz)的值改为25，默认是12，
*              改成25是为了跟system_ARMCM3.c中定义的__SYSTEM_CLOCK相同，确保仿真的时候时钟一致
*/
int main(void)
{	
	
   
//	list_test();

//	delay_test();
		
	task_test();
	
    for(;;)
	{
		/* 啥事不干 */
	}
}
